src/cf/Catalogs/ItobВариантыДинамическогоОформления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ItobВариантыДинамическогоОформления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминалДляОтбора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ItobТерминал</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Список_ЦветФона</Name>
					<Comment>B*256*256 + G*256 + R. Значения меньше нуля - цвет не задан пользователем</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Список_ЦветНадписи</Name>
					<Comment>B*256*256 + G*256 + R. Значения меньше нуля - цвет не задан пользователем</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карта_ЦветНадписи</Name>
					<Comment>B*256*256 + G*256 + R. Значения меньше нуля - цвет не задан пользователем</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карта_ДействиеСТекущейИконкой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ItobДействияСИконкамиВДинамическомОформлении</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыравниваниеДопИконки_ВариантОтносительногоПоложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ItobВариантыОтносительногоПоложенияДополнительныхИконок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыравниваниеДопИконки_СдвигПоОсиАбсцисс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыравниваниеДопИконки_СдвигПоОсиОрдинат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карта_НоваяИконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobИконкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВариантОформленияЗадержкиДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ItobЗадержкаДанныхТерминала</v8:Type>
								<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
								<v8:Type>cfg:EnumRef.ItobПоказательКоординат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ItobВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ItobСостоянияТерминалов</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ItobДействияСИконкамиВДинамическомОформлении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ItobДействияСИконкамиВДинамическомОформлении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Скрыть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменитьДополнительнойИконкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменитьВыбраннойИконкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывестиРядомВыбраннуюИконку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетДействия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ItobВариантыДинамическогоОформления/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаОтбора Из УсловияОтбора Цикл
		Если СтрокаОтбора.Значение = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Неверно заполнена таблица условий отбора:
											|	В строке %1 в колонке ""Значение"" не указан тип значения",
										СтрокаОтбора.НомерСтроки);
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли; 	
	КонецЦикла; 
	
	НеобязательныеРеквизиты = Новый Массив;
	
	Если НЕ ДляКарты Тогда
		НеобязательныеРеквизиты.Добавить("Карта_ДействиеСТекущейИконкой");	
	КонецЕсли; 
	
	Если НЕ Карта_ДействиеСТекущейИконкой = Перечисления.ItobДействияСИконкамиВДинамическомОформлении.ВывестиРядомВыбраннуюИконку Тогда
		НеобязательныеРеквизиты.Добавить("ВыравниваниеДопИконки_ВариантОтносительногоПоложения");
	КонецЕсли;
	
	Если НЕ (Карта_ДействиеСТекущейИконкой = Перечисления.ItobДействияСИконкамиВДинамическомОформлении.ВывестиРядомВыбраннуюИконку
		 	 ИЛИ Карта_ДействиеСТекущейИконкой = Перечисления.ItobДействияСИконкамиВДинамическомОформлении.ЗаменитьВыбраннойИконкой) Тогда
			 
		НеобязательныеРеквизиты.Добавить("Карта_НоваяИконка");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеобязательныеРеквизиты);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПропуститьАктуализациюОформления") Тогда
		Справочники.ItobВариантыДинамическогоОформления.АктуализироватьОформление();	
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
